In [1]:
people={
     "first":["Girish","Anagha","Soumya"],
    "last":["Jahagirdar","Jahagirdar","Jahagirdar"],
    "email":["girish@email.com","anagha@email.com","soumya@email.com"]
}

In [2]:
import pandas as pd
df = pd.DataFrame(people)

In [3]:
df

    first        last             email
0  Girish  Jahagirdar  girish@email.com
1  Anagha  Jahagirdar  anagha@email.com
2  Soumya  Jahagirdar  soumya@email.com

In [4]:
filt = (df['email'] == 'girish@email.com') | (df['first'] == 'Girish')

In [5]:
df.loc[filt,'last']

0    Jahagirdar
Name: last, dtype: object

In [6]:
df.loc[~filt,'last']

1    Jahagirdar
2    Jahagirdar
Name: last, dtype: object

In [7]:
df.rename(columns={'first':'firstname','last':'lastname'},inplace=True)
df

  firstname    lastname             email
0    Girish  Jahagirdar  girish@email.com
1    Anagha  Jahagirdar  anagha@email.com
2    Soumya  Jahagirdar  soumya@email.com

In [8]:
df.loc[1] = ['Satish','Jahagirdar','satish@email.com']
df.loc[2] = ['Anagha','Jahagirdar','anagha@email.com']
df.loc[3] = ['Preeti','Jahagirdar','preeti@email.com']
df

  firstname    lastname             email
0    Girish  Jahagirdar  girish@email.com
1    Satish  Jahagirdar  satish@email.com
2    Anagha  Jahagirdar  anagha@email.com
3    Preeti  Jahagirdar  preeti@email.com

In [9]:
df.loc[2,['firstname','email']]=['Ganu','ganu@email.com']
df

  firstname    lastname             email
0    Girish  Jahagirdar  girish@email.com
1    Satish  Jahagirdar  satish@email.com
2      Ganu  Jahagirdar    ganu@email.com
3    Preeti  Jahagirdar  preeti@email.com

In [10]:
df.loc[3,'firstname']='Soumya'
df

  firstname    lastname             email
0    Girish  Jahagirdar  girish@email.com
1    Satish  Jahagirdar  satish@email.com
2      Ganu  Jahagirdar    ganu@email.com
3    Soumya  Jahagirdar  preeti@email.com

In [11]:
filt = (df['email'] == 'ganu@email.com')
df.loc[filt,'firstname'] = 'Anagha'
df

  firstname    lastname             email
0    Girish  Jahagirdar  girish@email.com
1    Satish  Jahagirdar  satish@email.com
2    Anagha  Jahagirdar    ganu@email.com
3    Soumya  Jahagirdar  preeti@email.com

In [12]:
#df.drop(columns='firstname',inplace=True)

In [13]:
df

  firstname    lastname             email
0    Girish  Jahagirdar  girish@email.com
1    Satish  Jahagirdar  satish@email.com
2    Anagha  Jahagirdar    ganu@email.com
3    Soumya  Jahagirdar  preeti@email.com

In [14]:
df['email'] = df['email'].str.upper()

In [15]:
df

  firstname    lastname             email
0    Girish  Jahagirdar  GIRISH@EMAIL.COM
1    Satish  Jahagirdar  SATISH@EMAIL.COM
2    Anagha  Jahagirdar    GANU@EMAIL.COM
3    Soumya  Jahagirdar  PREETI@EMAIL.COM

In [16]:
df['email'].apply(len)

0    16
1    16
2    14
3    16
Name: email, dtype: int64

In [17]:
def update_email(email):
    return email.lower()

In [18]:
df['email'] = df['email'].apply(update_email)

In [19]:
df

  firstname    lastname             email
0    Girish  Jahagirdar  girish@email.com
1    Satish  Jahagirdar  satish@email.com
2    Anagha  Jahagirdar    ganu@email.com
3    Soumya  Jahagirdar  preeti@email.com

In [20]:
df.applymap(str.upper)

  firstname    lastname             email
0    GIRISH  JAHAGIRDAR  GIRISH@EMAIL.COM
1    SATISH  JAHAGIRDAR  SATISH@EMAIL.COM
2    ANAGHA  JAHAGIRDAR    GANU@EMAIL.COM
3    SOUMYA  JAHAGIRDAR  PREETI@EMAIL.COM

In [21]:
df.applymap(str.lower)

  firstname    lastname             email
0    girish  jahagirdar  girish@email.com
1    satish  jahagirdar  satish@email.com
2    anagha  jahagirdar    ganu@email.com
3    soumya  jahagirdar  preeti@email.com

In [22]:
df['firstname'].map({'Anagha':'Ganu','Soumya':'Preeti'})

0       NaN
1       NaN
2      Ganu
3    Preeti
Name: firstname, dtype: object

In [23]:
df['firstname'] = df['firstname'].replace({'Ganu':'Anagha','Preeti':'Soumya'})

In [24]:
df

  firstname    lastname             email
0    Girish  Jahagirdar  girish@email.com
1    Satish  Jahagirdar  satish@email.com
2    Anagha  Jahagirdar    ganu@email.com
3    Soumya  Jahagirdar  preeti@email.com

In [26]:
df['fullname'] = df['firstname']+' '+df['lastname']

In [27]:
df

  firstname    lastname             email           fullname
0    Girish  Jahagirdar  girish@email.com  Girish Jahagirdar
1    Satish  Jahagirdar  satish@email.com  Satish Jahagirdar
2    Anagha  Jahagirdar    ganu@email.com  Anagha Jahagirdar
3    Soumya  Jahagirdar  preeti@email.com  Soumya Jahagirdar

In [30]:
df.drop(columns=['firstname','lastname'],inplace=True)
df

              email           fullname
0  girish@email.com  Girish Jahagirdar
1  satish@email.com  Satish Jahagirdar
2    ganu@email.com  Anagha Jahagirdar
3  preeti@email.com  Soumya Jahagirdar

In [34]:
df[['first','last']] = df['fullname'].str.split(' ',expand=True)

In [35]:
df

              email           fullname   first        last
0  girish@email.com  Girish Jahagirdar  Girish  Jahagirdar
1  satish@email.com  Satish Jahagirdar  Satish  Jahagirdar
2    ganu@email.com  Anagha Jahagirdar  Anagha  Jahagirdar
3  preeti@email.com  Soumya Jahagirdar  Soumya  Jahagirdar

In [40]:
df.append({'first':'Sahithya','last':'Jahagirdar'},ignore_index=True,sort=False)

C:\Users\Dell\AppData\Local\Temp\ipykernel_21332\281708920.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Sahithya','last':'Jahagirdar'},ignore_index=True,sort=False)

              email           fullname     first        last
0  girish@email.com  Girish Jahagirdar    Girish  Jahagirdar
1  satish@email.com  Satish Jahagirdar    Satish  Jahagirdar
2    ganu@email.com  Anagha Jahagirdar    Anagha  Jahagirdar
3  preeti@email.com  Soumya Jahagirdar    Soumya  Jahagirdar
4               NaN                NaN  Sahithya  Jahagirdar

In [43]:
dframe ={
         'first':['A','B'],
         'last':['X','Y'],
         'email':['A@email.com','B@email.com']
}

In [44]:
df2 = pd.DataFrame(dframe)
df2

  first last        email
0     A    X  A@email.com
1     B    Y  B@email.com

In [46]:
df.append(df2,ignore_index=True,sort=False)

C:\Users\Dell\AppData\Local\Temp\ipykernel_21332\1395412685.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True,sort=False)

              email           fullname   first        last
0  girish@email.com  Girish Jahagirdar  Girish  Jahagirdar
1  satish@email.com  Satish Jahagirdar  Satish  Jahagirdar
2    ganu@email.com  Anagha Jahagirdar  Anagha  Jahagirdar
3  preeti@email.com  Soumya Jahagirdar  Soumya  Jahagirdar
4       A@email.com                NaN       A           X
5       B@email.com                NaN       B           Y

In [52]:
df2=df.append(df2,ignore_index=True,sort=False)

C:\Users\Dell\AppData\Local\Temp\ipykernel_21332\1485852061.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2=df.append(df2,ignore_index=True,sort=False)

In [53]:
df2.drop(index=5)

              email           fullname   first        last
0  girish@email.com  Girish Jahagirdar  Girish  Jahagirdar
1  satish@email.com  Satish Jahagirdar  Satish  Jahagirdar
2    ganu@email.com  Anagha Jahagirdar  Anagha  Jahagirdar
3  preeti@email.com  Soumya Jahagirdar  Soumya  Jahagirdar
4       A@email.com                NaN       A           X

In [55]:
flt = df2['first']=='A'
df2.drop(index=df2[flt].index)

              email           fullname   first        last
0  girish@email.com  Girish Jahagirdar  Girish  Jahagirdar
1  satish@email.com  Satish Jahagirdar  Satish  Jahagirdar
2    ganu@email.com  Anagha Jahagirdar  Anagha  Jahagirdar
3  preeti@email.com  Soumya Jahagirdar  Soumya  Jahagirdar
5       B@email.com                NaN       B           Y

In [56]:
people = {
    'first': ['Corey', 'Jane', 'John', 'Adam'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', 'A@email.com']
}

In [57]:
import pandas as pd
df3 = pd.DataFrame(people)
df3

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [59]:
df3.sort_values(by='first',ascending=False)

   first     last                    email
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com

In [61]:
df3.sort_values(by=['last','first'],ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
3   Adam      Doe              A@email.com

In [62]:
df3.sort_values(by=['last','first'],ascending=[False,True])

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [63]:
df3.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [65]:
df3['first'].sort_values()

3     Adam
0    Corey
1     Jane
2     John
Name: first, dtype: object